// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "喜欢的姑娘",  // 同上...
        "今天是你出院的第一天",
        "这是我们在一起的",
        "第一个七夕情人节！",
        "这些天，我见过你",
        "奇怪的样子",
        "可爱的样子",
        "生气的样子",
        "都是我喜欢的样子",
        "对了，伤口还疼吗？",
        "记得要多休息少出汗",
        "健健康康的",
        "然后才能带你出去逛吃逛吃~",
        "小乖乖~小宝宝~",
        "七夕快乐~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给我": "./imgs/a1.jpeg",
        "喜欢的姑娘": "./imgs/a.jpg",
        "今天是你出院的第一天": "./imgs/a2.jpg",
        "这是我们在一起的": "./imgs/a3.jpg",
        "第一个七夕情人节！": "./imgs/a.jpg",
        "这些天，我见过你": "./imgs/a4.jpeg",
        "奇怪的样子": "./imgs/a.jpg",
        "可爱的样子": "./imgs/a.jpg",
        "生气的样子": "./imgs/a.jpg",
        "都是我喜欢的样子": "./imgs/a.jpg",
        "对了，伤口还疼吗？": "./imgs/a5.jpg",
        "记得要多休息少出汗": "./imgs/a5.jpg",
        "健健康康的": "./imgs/a5.jpg",
        "然后才能带你出去逛吃逛吃~": "./imgs/a6.jpg",
        "小乖乖~小宝宝~": "./imgs/a7.jpg",
        "七夕快乐~~": "./imgs/a8.jpg"
    },
    
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "点我开始",
        play: "上音乐",
        bannar_coming: "搞点颜色",
        balloons_flying: "好像还少点东西",
        cake_fadein: " 蛋糕？",
        light_candle: " 蜡烛？",
        wish_message: " 七夕快乐～",
        story: "摸摸头"
    },

    // 结束语
    loveText: '做我女朋友好吗~'
};
